IDEA StatiCa Open Model
ReportSettings.Views Property
Compatible with IDEA StatiCa Beta 21.0 - beta
 Indicates, whether generate views (XY, XZ, YZ) into report.
 Namespace: IdeaRS.OpenModel.Connection
 Assembly: IdeaRS.OpenModel (in IdeaRS.OpenModel.dll) Version: 20.0.1.1 (20.0.1.1)
Syntax
public bool Views { get; set; }
Public Property Views As Boolean
	Get
	Set
public:
property bool Views {
	bool get ();
	void set (bool value);
}
Property Value
Type: Boolean
See Also
Reference
ReportSettings Class
IdeaRS.OpenModel.Connection Namespace